/*
Задача 10. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.


int Method(int num)
{
    int figure = num / 10 % 10;
        return figure;
}

int random = new Random().Next(100, 1000);
int result = Method(random);

Console.WriteLine($"У числа {random} второй цифрой является: {result}");
*/

/*
Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
*/

